In [1]:
import pandas as pd
import numpy as np

In [2]:
ser = pd.Series([0,10,20,30,40,50,60,70,80,90,100])

In [3]:
print(ser)

0       0
1      10
2      20
3      30
4      40
5      50
6      60
7      70
8      80
9      90
10    100
dtype: int64

In [4]:
ser1 = pd.Series([0,10,20,30,40,50,60,70,80,90,100,'data'])

In [5]:
print(ser1)

0        0
1       10
2       20
3       30
4       40
5       50
6       60
7       70
8       80
9       90
10     100
11    data
dtype: object

In [6]:
print(ser1[11])

data

In [7]:
ser1[11] = 101

In [9]:
print(ser1)

0       0
1      10
2      20
3      30
4      40
5      50
6      60
7      70
8      80
9      90
10    100
11    101
dtype: object

In [10]:
# create dictionary

dict1 = {'A':[1,2,3],'B':[2,3,4],'C':[22,33,44],'D':[33,99,56]}

In [13]:
df = pd.DataFrame(dict1)

In [14]:
print(df)

   A  B   C   D
0  1  2  22  33
1  2  3  33  99
2  3  4  44  56

### Adding new column

In [15]:
df['States'] = "CA NV AZ".split()

In [16]:
df

   A  B   C   D States
0  1  2  22  33     CA
1  2  3  33  99     NV
2  3  4  44  56     AZ

In [17]:
## understanding split() method while Adding

var = "CA NV AZ".split()

In [18]:
var

['CA', 'NV', 'AZ']

## Create NAN and manipulation

In [21]:
dict2 = {'A':[1,2,np.nan],'B':[5,np.nan,np.nan],'C':[22,33,44]}

In [22]:
df1 = pd.DataFrame(dict2)

In [23]:
df1

     A    B   C
0  1.0  5.0  22
1  2.0  NaN  33
2  NaN  NaN  44

In [24]:
df1['states'] = 'CA NV AZ'.split()

In [25]:
df1

     A    B   C states
0  1.0  5.0  22     CA
1  2.0  NaN  33     NV
2  NaN  NaN  44     AZ

In [28]:
print('\n Dropping any column with a NaN values\n','-'*30,sep ='')
print(df1.dropna(axis =1))

## axis = colunms wise
## axis = 0 rows wise

 Dropping any column with a NaN values
------------------------------
    C states
0  22     CA
1  33     NV
2  44     AZ

In [30]:
df1
## my dataFrame till have the same original dataset

     A    B   C states
0  1.0  5.0  22     CA
1  2.0  NaN  33     NV
2  NaN  NaN  44     AZ

## The method __fillna()__

In [34]:
print('\n Dropping any column with a NaN values\n','-'*38)
print(df1.fillna(value = 20))

 Dropping any column with a NaN values
 --------------------------------------
      A     B   C states
0   1.0   5.0  22     CA
1   2.0  20.0  33     NV
2  20.0  20.0  44     AZ

In [84]:
print('\n Dropping any row with a NaN values\n','-'*38,sep ='')
print(df1.dropna(axis =1))
## axis = 1  colunms wise
## axis = 0 rows wise

 Dropping any row with a NaN values
--------------------------------------
    C states
0  22     CA
1  33     NV
2  44     AZ

In [39]:
## fill with specifique column mean

print('\n Dropping any column with a NaN values\n','-'*38)
print(df1.fillna(value = df1['A'].mean()))

 Dropping any column with a NaN values
 --------------------------------------
     A    B   C states
0  1.0  5.0  22     CA
1  2.0  1.5  33     NV
2  1.5  1.5  44     AZ

In [41]:
my_dict = {
    'Company':['Good','Good','MSFT','MSFT','FB','FB'],
    'Person':['Sam','Charlie','Any','Vanessa','Carl','Sarah'],
    'Sale':[200,120,340,124,243,350]
    
}

In [42]:
df3 = pd.DataFrame(my_dict)

In [43]:
df3

  Company   Person  Sale
0    Good      Sam   200
1    Good  Charlie   120
2    MSFT      Any   340
3    MSFT  Vanessa   124
4      FB     Carl   243
5      FB    Sarah   350

In [54]:
by_comp = df3.groupby("Company")

In [46]:
by_comp.mean()

          Sale
Company
FB       296.5
Good     160.0
MSFT     232.0

In [55]:
print('\nGrouping by colum "Company" and listing of sale\n','-'*55,sep='')
by_comp.sum()

### it will calculate only where the column values's is number

Grouping by colum "Company" and listing of sale
-------------------------------------------------------

         Sale
Company
FB        593
Good      320
MSFT      464

## to save everithing permently use __inplace__ = true

In [56]:
df

   A  B   C   D States
0  1  2  22  33     CA
1  2  3  33  99     NV
2  3  4  44  56     AZ

In [57]:
df1

     A    B   C states
0  1.0  5.0  22     CA
1  2.0  NaN  33     NV
2  NaN  NaN  44     AZ

In [71]:
my_data = pd.DataFrame(
{
    'Company':['Good','Good','MSFT','MSFT','FB','FB'],
    'Person':['Sam','Charlie','Any','Vanessa','Carl','Sarah'],
    'Sale':[200,120,340,124,243,350]
    
},index =['A1','A2','A3','A4','A5','A6'])

In [72]:
my_data

   Company   Person  Sale
A1    Good      Sam   200
A2    Good  Charlie   120
A3    MSFT      Any   340
A4    MSFT  Vanessa   124
A5      FB     Carl   243
A6      FB    Sarah   350

In [69]:
my_data1 = pd.DataFrame(
{
    'Company':['Good','Good','MSFT','MSFT','FB','FB'],
    'Person':['Assie','Yao','Brou','Kouadio','Patrick','Sarah'],
    'Sale':[200,120,340,124,243,350]
    
},index =['A7','A8','A9','A10','A11','A12'])

In [70]:
my_data1

    Company   Person  Sale
A7     Good    Assie   200
A8     Good      Yao   120
A9     MSFT     Brou   340
A10    MSFT  Kouadio   124
A11      FB  Patrick   243
A12      FB    Sarah   350

In [77]:
result_data = pd.concat([my_data,my_data1], axis = 0)

In [82]:
result_data

    Company   Person  Sale
A1     Good      Sam   200
A2     Good  Charlie   120
A3     MSFT      Any   340
A4     MSFT  Vanessa   124
A5       FB     Carl   243
A6       FB    Sarah   350
A7     Good    Assie   200
A8     Good      Yao   120
A9     MSFT     Brou   340
A10    MSFT  Kouadio   124
A11      FB  Patrick   243
A12      FB    Sarah   350

In [85]:
result_data1 = pd.concat([my_data,my_data1], axis = 1)

In [86]:
result_data1

    Company   Person   Sale Company   Person   Sale
A1     Good      Sam  200.0     NaN      NaN    NaN
A2     Good  Charlie  120.0     NaN      NaN    NaN
A3     MSFT      Any  340.0     NaN      NaN    NaN
A4     MSFT  Vanessa  124.0     NaN      NaN    NaN
A5       FB     Carl  243.0     NaN      NaN    NaN
A6       FB    Sarah  350.0     NaN      NaN    NaN
A7      NaN      NaN    NaN    Good    Assie  200.0
A8      NaN      NaN    NaN    Good      Yao  120.0
A9      NaN      NaN    NaN    MSFT     Brou  340.0
A10     NaN      NaN    NaN    MSFT  Kouadio  124.0
A11     NaN      NaN    NaN      FB  Patrick  243.0
A12     NaN      NaN    NaN      FB    Sarah  350.0

In [87]:
result_data1.fillna(value = 100, inplace = True)

In [88]:
result_data1

    Company   Person   Sale Company   Person   Sale
A1     Good      Sam  200.0     100      100  100.0
A2     Good  Charlie  120.0     100      100  100.0
A3     MSFT      Any  340.0     100      100  100.0
A4     MSFT  Vanessa  124.0     100      100  100.0
A5       FB     Carl  243.0     100      100  100.0
A6       FB    Sarah  350.0     100      100  100.0
A7      100      100  100.0    Good    Assie  200.0
A8      100      100  100.0    Good      Yao  120.0
A9      100      100  100.0    MSFT     Brou  340.0
A10     100      100  100.0    MSFT  Kouadio  124.0
A11     100      100  100.0      FB  Patrick  243.0
A12     100      100  100.0      FB    Sarah  350.0

# End of __Saturday__ live class